; domain
(define (domain grid)
(:requirements :strips)
(:predicates (conn ?x ?y)
             (key-shape ?k ?s)
             (lock-shape ?x ?s)
             (at ?r ?x )
	     (at-robot ?x)
             (place ?p)
             (key ?k)
             (shape ?s)
             (locked ?x)
             (holding ?k)
             (open ?x)
             (arm-empty ))



(:action unlock
:parameters (?curpos ?lockpos ?key ?shape)
:precondition (and (place ?curpos) (place ?lockpos) (key ?key) (shape ?shape)
          (conn ?curpos ?lockpos) (key-shape ?key ?shape)
                   (lock-shape ?lockpos ?shape) (at-robot ?curpos)
                   (locked ?lockpos) (holding ?key))
:effect (and  (open ?lockpos) (not (locked ?lockpos))))


(:action move
:parameters (?curpos ?nextpos)
:precondition (and (place ?curpos) (place ?nextpos)
               (at-robot ?curpos) (conn ?curpos ?nextpos) (open ?nextpos))
:effect (and (at-robot ?nextpos) (not (at-robot ?curpos))))

(:action pickup
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key)
                  (at-robot ?curpos) (at ?key ?curpos) (arm-empty ))
:effect (and (holding ?key)
   (not (at ?key ?curpos)) (not (arm-empty ))))


(:action pickup-and-loose
:parameters (?curpos ?newkey ?oldkey)
:precondition (and (place ?curpos) (key ?newkey) (key ?oldkey)
                  (at-robot ?curpos) (holding ?oldkey) (at ?newkey ?curpos))
:effect (and (holding ?newkey) (at ?oldkey ?curpos)
        (not (holding ?oldkey)) (not (at ?newkey ?curpos))))

(:action putdown
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key)
                  (at-robot ?curpos) (holding ?key))
:effect (and (arm-empty ) (at ?key ?curpos) (not (holding ?key)))))

; problem
(define (problem grid-3-4-1-5-2)
    (:domain grid)
    (:objects
    pos0-0 pos0-1 pos0-2 pos0-3 pos1-0 pos1-1 pos1-2 pos1-3 pos2-0 pos2-1 pos2-2 pos2-3
    shape0
    key0 key1 key2 key3 key4
    )

    (:init
       (arm-empty)

       (place pos0-0)
       (place pos0-1)
       (place pos0-2)
       (place pos0-3)
       (place pos1-0)
       (place pos1-1)
       (place pos1-2)
       (place pos1-3)
       (place pos2-0)
       (place pos2-1)
       (place pos2-2)
       (place pos2-3)
       (shape shape0)
       (key key0)
       (key key1)
       (key key2)
       (key key3)
       (key key4)

       (conn pos0-0 pos1-0)
       (conn pos0-0 pos0-1)
       (conn pos0-1 pos1-1)
       (conn pos0-1 pos0-2)
       (conn pos0-1 pos0-0)
       (conn pos0-2 pos1-2)
       (conn pos0-2 pos0-3)
       (conn pos0-2 pos0-1)
       (conn pos0-3 pos1-3)
       (conn pos0-3 pos0-2)
       (conn pos1-0 pos2-0)
       (conn pos1-0 pos1-1)
       (conn pos1-0 pos0-0)
       (conn pos1-1 pos2-1)
       (conn pos1-1 pos1-2)
       (conn pos1-1 pos0-1)
       (conn pos1-1 pos1-0)
       (conn pos1-2 pos2-2)
       (conn pos1-2 pos1-3)
       (conn pos1-2 pos0-2)
       (conn pos1-2 pos1-1)
       (conn pos1-3 pos2-3)
       (conn pos1-3 pos0-3)
       (conn pos1-3 pos1-2)
       (conn pos2-0 pos2-1)
       (conn pos2-0 pos1-0)
       (conn pos2-1 pos2-2)
       (conn pos2-1 pos1-1)
       (conn pos2-1 pos2-0)
       (conn pos2-2 pos2-3)
       (conn pos2-2 pos1-2)
       (conn pos2-2 pos2-1)
       (conn pos2-3 pos1-3)
       (conn pos2-3 pos2-2)
       (locked pos0-2)
       (locked pos0-3)
       (lock-shape  pos0-2 shape0)
       (lock-shape  pos0-3 shape0)
       (open pos0-0)
       (open pos0-1)
       (open pos1-0)
       (open pos1-1)
       (open pos1-2)
       (open pos1-3)
       (open pos2-0)
       (open pos2-1)
       (open pos2-2)
       (open pos2-3)

       (key-shape  key0 shape0)
       (key-shape  key1 shape0)
       (key-shape  key2 shape0)
       (key-shape  key3 shape0)
       (key-shape  key4 shape0)
       (at key0 pos2-2)
       (at key1 pos1-0)
       (at key2 pos1-1)
       (at key3 pos2-1)
       (at key4 pos2-1)
       (at-robot pos2-1)
    )

    (:goal (and
       (at key0 pos1-1)
       (at key1 pos0-3)
       (at key2 pos2-1)
       (at key3 pos1-1)
       (at key4 pos2-3)
    )))

; plan
1. (pickup pos2-1 key4)
   deleted: (at key4 pos2-1) (arm-empty)
   added: (holding key4)
   goals met: 0 of 5
2. (move pos2-1 pos2-2)
   deleted: (at-robot pos2-1)
   added: (at-robot pos2-2)
   goals met: 0 of 5
3. (move pos2-2 pos2-3)
   deleted: (at-robot pos2-2)
   added: (at-robot pos2-3)
   goals met: 0 of 5
4. (putdown pos2-3 key4)
   deleted: (holding key4)
   added: (arm-empty) (at key4 pos2-3)
   goals met: 1 of 5
5. (move pos2-3 pos2-2)
   deleted: (at-robot pos2-3)
   added: (at-robot pos2-2)
   goals met: 1 of 5
6. (pickup pos2-2 key0)
   deleted: (at key0 pos2-2) (arm-empty)
   added: (holding key0)
   goals met: 1 of 5
7. (move pos2-2 pos1-2)
   deleted: (at-robot pos2-2)
   added: (at-robot pos1-2)
   goals met: 1 of 5
8. (move pos1-2 pos1-1)
   deleted: (at-robot pos1-2)
   added: (at-robot pos1-1)
   goals met: 1 of 5
9. (pickup-and-loose pos1-1 key2 key0)
   deleted: (holding key0) (at key2 pos1-1)
   added: (holding key2) (at key0 pos1-1)
   goals met: 2 of 5
10. (move pos1-1 pos2-1)
   deleted: (at-robot pos1-1)
   added: (at-robot pos2-1)
   goals met: 2 of 5
11. (pickup-and-loose pos2-1 key3 key2)
   deleted: (holding key2) (at key3 pos2-1)
   added: (holding key3) (at key2 pos2-1)
   goals met: 3 of 5
12. (move pos2-1 pos1-1)
   deleted: (at-robot pos2-1)
   added: (at-robot pos1-1)
   goals met: 3 of 5
13. (putdown pos1-1 key3)
   deleted: (holding key3)
   added: (arm-empty) (at key3 pos1-1)
   goals met: 4 of 5
14. (move pos1-1 pos1-0)
   deleted: (at-robot pos1-1)
   added: (at-robot pos1-0)
   goals met: 4 of 5
15. (pickup pos1-0 key1)
   deleted: (at key1 pos1-0) (arm-empty)
   added: (holding key1)
   goals met: 4 of 5
16. (move pos1-0 pos1-1)
   deleted: (at-robot pos1-0)
   added: (at-robot pos1-1)
   goals met: 4 of 5
17. (move pos1-1 pos1-2)
   deleted: (at-robot pos1-1)
   added: (at-robot pos1-2)
   goals met: 4 of 5
18. (move pos1-2 pos1-3)
   deleted: (at-robot pos1-2)
   added: (at-robot pos1-3)
   goals met: 4 of 5
19. (unlock pos1-3 pos0-3 key1 shape0)
   deleted: (locked pos0-3)
   added: (open pos0-3)
   goals met: 4 of 5
20. (move pos1-3 pos0-3)
   deleted: (at-robot pos1-3)
   added: (at-robot pos0-3)
   goals met: 4 of 5
21. (putdown pos0-3 key1)
   deleted: (holding key1)
   added: (arm-empty) (at key1 pos0-3)
   goals met: 5 of 5
